Repository: endarthur/pollywog
Catalog: docs/locale/*/LC_MESSAGES/geologist_tutorial.po
Languages: pt_br

source: Tutorial for Resource Geologists
pt_br: Tutorial para Geólogos de Recursos

source: Welcome! This tutorial is specifically designed for resource geologists who are comfortable with Leapfrog and its calculator but are new to programming with Python. If you've built calculations in Leapfrog using the calculator interface, you already have the conceptual foundation to use Pollywog—we'll just show you how to express those same ideas in Python code.
pt_br: Bem-vindo! Este tutorial foi especificamente desenvolvido para geólogos de recursos que estão familiarizados com o Leapfrog e sua calculadora, mas são novos em programação com Python. Se você já construiu cálculos no Leapfrog usando a interface da calculadora, você já tem a base conceitual para usar o Pollywog—vamos apenas mostrar como expressar essas mesmas ideias em código Python.

source: This tutorial assumes you already know how to use Leapfrog and its calculator. If you can create formulas in Leapfrog's calculator dialog (like ``[Au] * 2`` or ``if([Au] > 0.5, "ore", "waste")``), you're ready to learn Pollywog!
pt_br: Este tutorial assume que você já sabe usar o Leapfrog e sua calculadora. Se você consegue criar fórmulas na caixa de diálogo da calculadora do Leapfrog (como ``[Au] * 2`` ou ``if([Au] > 0.5, "ore", "waste")``), você está pronto para aprender Pollywog!

source: Why Learn Pollywog?
pt_br: Por Que Aprender Pollywog?

source: You might be wondering: "I can already create calculations in Leapfrog—why learn Python?"
pt_br: Você pode estar se perguntando: "Eu já consigo criar cálculos no Leapfrog—por que aprender Python?"

source: Here's why Pollywog is worth your time:
pt_br: Aqui está por que o Pollywog vale o seu tempo:

source: **Time Savings**
pt_br: **Economia de Tempo**

source: Creating 100 calculations manually in Leapfrog: **2-3 hours**
pt_br: Criar 100 cálculos manualmente no Leapfrog: **2-3 horas**

source: Creating the same 100 calculations with Pollywog: **5 minutes**
pt_br: Criar os mesmos 100 cálculos com Pollywog: **5 minutos**

source: Once you learn the basics, you'll save hours on every project
pt_br: Uma vez que você aprende o básico, você economizará horas em cada projeto

source: **Consistency**
pt_br: **Consistência**

source: Manual work: Easy to make typos or miss a domain
pt_br: Trabalho manual: Fácil cometer erros de digitação ou esquecer um domínio

source: Pollywog: If one calculation is right, all 100 are right
pt_br: Pollywog: Se um cálculo está correto, todos os 100 estão corretos

source: **Reusability**
pt_br: **Reutilização**

source: Manual work: Start from scratch for each project
pt_br: Trabalho manual: Começar do zero em cada projeto

source: Pollywog: Reuse your scripts across multiple projects
pt_br: Pollywog: Reutilize seus scripts em múltiplos projetos

source: **Documentation**
pt_br: **Documentação**

source: Manual work: Hard to explain what you did
pt_br: Trabalho manual: Difícil explicar o que você fez

source: Pollywog: Your Python code is the documentation
pt_br: Pollywog: Seu código Python é a documentação

source: Quick Start: Your First Calculation in 5 Minutes
pt_br: Início Rápido: Seu Primeiro Cálculo em 5 Minutos

source: Let's get you winning immediately. We'll create a simple calculation, export it, and import it into Leapfrog. You can understand the details later—right now, let's just see it work!
pt_br: Vamos fazer você ter sucesso imediatamente. Vamos criar um cálculo simples, exportá-lo e importá-lo no Leapfrog. Você pode entender os detalhes mais tarde—agora, vamos apenas ver funcionando!

source: Step 1: Open JupyterLite
pt_br: Passo 1: Abrir JupyterLite

source: Visit `https://endarthur.github.io/pollyweb <https://endarthur.github.io/pollyweb>`_
pt_br: Visite `https://endarthur.github.io/pollyweb <https://endarthur.github.io/pollyweb>`_

source: Click the **+** button and select **Python (Pyodide)** under "Notebook". You now have a blank notebook.
pt_br: Clique no botão **+** e selecione **Python (Pyodide)** em "Notebook". Você agora tem um notebook em branco.

source: Step 2: Copy and Run This Code
pt_br: Passo 2: Copiar e Executar Este Código

source: In the first cell, copy this exactly:
pt_br: Na primeira célula, copie exatamente isto:

source: Press **Shift+Enter** to run it.
pt_br: Pressione **Shift+Enter** para executá-lo.

source: Step 3: Download the File
pt_br: Passo 3: Baixar o Arquivo

source: In the file browser on the left, you should see ``my_first_pollywog.lfcalc``. Right-click it and select **Download**.
pt_br: No navegador de arquivos à esquerda, você deve ver ``my_first_pollywog.lfcalc``. Clique com o botão direito e selecione **Download**.

source: Step 4: Import into Leapfrog
pt_br: Passo 4: Importar no Leapfrog

source: Open your Leapfrog project
pt_br: Abra seu projeto Leapfrog

source: Navigate to your block model or drillhole data
pt_br: Navegue até seu modelo de blocos ou dados de furo de sondagem

source: Right-click on the "Evaluations" or "Numeric" section
pt_br: Clique com o botão direito na seção "Evaluations" ou "Numeric"

source: Select "Import" → "From File"
pt_br: Selecione "Import" → "From File"

source: Choose your ``my_first_pollywog.lfcalc`` file
pt_br: Escolha seu arquivo ``my_first_pollywog.lfcalc``

source: You should now see a calculation called ``Au_capped`` in Leapfrog that caps gold values between 0 and 50!
pt_br: Você deve agora ver um cálculo chamado ``Au_capped`` no Leapfrog que limita valores de ouro entre 0 e 50!

source: 🎉 **Congratulations!** You just automated your first Leapfrog calculation with code.
pt_br: **Parabéns!** Você acabou de automatizar seu primeiro cálculo do Leapfrog com código.

source: Now let's understand what you just did...
pt_br: Agora vamos entender o que você acabou de fazer...

source: Getting Started with JupyterLite
pt_br: Começando com JupyterLite

source: JupyterLite runs Python directly in your web browser—no installation required.
pt_br: JupyterLite executa Python diretamente no seu navegador—sem necessidade de instalação.

source: **Important:** JupyterLite saves your work in your browser's memory. If you clear your browser cache, you'll lose your work! Always download your notebooks and .lfcalc files when you're done.
pt_br: **Importante:** JupyterLite salva seu trabalho na memória do navegador. Se você limpar o cache do navegador, você perderá seu trabalho! Sempre baixe seus notebooks e arquivos .lfcalc quando terminar.

source: The JupyterLite Interface
pt_br: A Interface do JupyterLite

source: When you open JupyterLite, you'll see:
pt_br: Quando você abre o JupyterLite, você verá:

source: **File Browser (left side)**: Like Windows Explorer, shows your notebooks and files
pt_br: **Navegador de Arquivos (lado esquerdo)**: Como o Windows Explorer, mostra seus notebooks e arquivos

source: **Notebook (center)**: Where you write and run Python code
pt_br: **Notebook (centro)**: Onde você escreve e executa código Python

source: **Code Cells**: Boxes where you type Python code
pt_br: **Células de Código**: Caixas onde você digita código Python

source: **Run Button**: Click it to execute the code in a cell (or press Shift+Enter)
pt_br: **Botão Executar**: Clique nele para executar o código em uma célula (ou pressione Shift+Enter)

source: Creating Cells
pt_br: Criando Células

source: Notebooks have two types of cells:
pt_br: Notebooks têm dois tipos de células:

source: **Code Cells** (for Python)
pt_br: **Células de Código** (para Python)

source: Type Python code here and run it with Shift+Enter
pt_br: Digite código Python aqui e execute com Shift+Enter

source: **Markdown Cells** (for notes)
pt_br: **Células Markdown** (para anotações)

source: Document what your code does. To create one:
pt_br: Documente o que seu código faz. Para criar uma:

source: Click on a cell
pt_br: Clique em uma célula

source: Change the dropdown from "Code" to "Markdown"
pt_br: Mude o menu dropdown de "Code" para "Markdown"

source: Type your notes (you can use headings, bullet points, bold text)
pt_br: Digite suas anotações (você pode usar títulos, marcadores, texto em negrito)

source: Press Shift+Enter to render it
pt_br: Pressione Shift+Enter para renderizá-la

source: **Example markdown:**
pt_br: **Exemplo de markdown:**

source: For more on Jupyter and markdown, see the `Jupyter documentation <https://jupyter-notebook.readthedocs.io/en/stable/>`_.
pt_br: Para mais sobre Jupyter e markdown, veja a `documentação do Jupyter <https://jupyter-notebook.readthedocs.io/en/stable/>`_.

source: Python Essentials for Geologists
pt_br: Fundamentos de Python para Geólogos

source: Good news: You don't need to become a Python expert! You need about 5 core concepts, and the rest you can Google when needed (just like you do with Excel formulas).
pt_br: Boa notícia: Você não precisa se tornar um especialista em Python! Você precisa de cerca de 5 conceitos centrais, e o resto você pode pesquisar no Google quando necessário (assim como você faz com fórmulas do Excel).

source: Let's learn just enough Python to be productive.
pt_br: Vamos aprender apenas o suficiente de Python para ser produtivo.

source: Importing: Getting Your Tools
pt_br: Importando: Obtendo Suas Ferramentas

source: Before you can use Pollywog, you need to import it (like opening a toolbox).
pt_br: Antes de usar o Pollywog, você precisa importá-lo (como abrir uma caixa de ferramentas).

source: **Try this in a code cell:**
pt_br: **Tente isto em uma célula de código:**

source: Press Shift+Enter. If no error appears, you're ready!
pt_br: Pressione Shift+Enter. Se nenhum erro aparecer, você está pronto!

source: Always put your imports at the top of your notebook. That way all your tools are loaded before you use them.
pt_br: Sempre coloque suas importações no topo do seu notebook. Dessa forma todas as suas ferramentas são carregadas antes de você usá-las.

source: Strings: Text in Quotes
pt_br: Strings: Texto Entre Aspas

source: In Python, text goes in quotes. You'll use this for calculation names and expressions.
pt_br: Em Python, texto vai entre aspas. Você usará isso para nomes de cálculos e expressões.

source: **Try this:**
pt_br: **Tente isto:**

source: **You should see:**
pt_br: **Você deve ver:**

source: **Important:** Leapfrog expressions (like ``"clamp([Au], 0)"``) are just text strings to Python. The square brackets ``[Au]`` are part of the text, not Python syntax.
pt_br: **Importante:** Expressões do Leapfrog (como ``"clamp([Au], 0)"``) são apenas strings de texto para Python. Os colchetes ``[Au]`` são parte do texto, não sintaxe Python.

source: **Quote types:**
pt_br: **Tipos de aspas:**

source: Variables: Storing Values
pt_br: Variáveis: Armazenando Valores

source: In Python, you store values in variables (different from Leapfrog's ``[Au]`` variables!).
pt_br: Em Python, você armazena valores em variáveis (diferente das variáveis ``[Au]`` do Leapfrog!).

source: **Key points:**
pt_br: **Pontos-chave:**

source: Variable names don't use square brackets (that's Leapfrog syntax)
pt_br: Nomes de variáveis não usam colchetes (isso é sintaxe do Leapfrog)

source: Use ``=`` to assign a value
pt_br: Use ``=`` para atribuir um valor

source: Lines starting with ``#`` are comments (notes to yourself)
pt_br: Linhas começando com ``#`` são comentários (anotações para você mesmo)

source: Lists: Multiple Items
pt_br: Listas: Múltiplos Itens

source: Sometimes you need multiple items. Use square brackets to make a list.
pt_br: Às vezes você precisa de múltiplos itens. Use colchetes para fazer uma lista.

source: **Think of it like:** A column in Excel—multiple values in one container.
pt_br: **Pense nisso como:** Uma coluna no Excel—múltiplos valores em um container.

source: Functions: Doing Things
pt_br: Funções: Fazendo Coisas

source: Functions perform actions. You call them with parentheses ``()``.
pt_br: Funções executam ações. Você as chama com parênteses ``()``.

source: You'll mostly be *using* functions that Pollywog provides, not creating your own.
pt_br: Você estará principalmente *usando* funções que o Pollywog fornece, não criando as suas próprias.

source: Comments: Documenting Your Work
pt_br: Comentários: Documentando Seu Trabalho

source: Lines starting with ``#`` are comments—Python ignores them. Use them to explain your thinking.
pt_br: Linhas começando com ``#`` são comentários—Python os ignora. Use-os para explicar seu raciocínio.

source: From Leapfrog Calculator to Pollywog
pt_br: Da Calculadora do Leapfrog para Pollywog

source: Let's translate what you know from Leapfrog's calculator into Pollywog code.
pt_br: Vamos traduzir o que você sabe da calculadora do Leapfrog em código Pollywog.

source: Simple Calculation
pt_br: Cálculo Simples

source: **In Leapfrog Calculator:**
pt_br: **Na Calculadora do Leapfrog:**

source: Name: ``Au_clean``
pt_br: Nome: ``Au_clean``

source: Expression: ``clamp([Au], 0)``
pt_br: Expressão: ``clamp([Au], 0)``

source: Comment: "Remove negative values"
pt_br: Comentário: "Remove negative values"

source: **In Pollywog:**
pt_br: **No Pollywog:**

source: **What's happening:**
pt_br: **O que está acontecendo:**

source: ``Number(...)`` creates a numeric calculation
pt_br: ``Number(...)`` cria um cálculo numérico

source: First parameter: the name (``"Au_clean"``)
pt_br: Primeiro parâmetro: o nome (``"Au_clean"``)

source: Second parameter: the expression (``"clamp([Au], 0)"``)
pt_br: Segundo parâmetro: a expressão (``"clamp([Au], 0)"``)

source: ``comment_equation=`` adds a comment (optional but recommended)
pt_br: ``comment_equation=`` adiciona um comentário (opcional mas recomendado)

source: Notice that expressions in Pollywog use the **exact same syntax** as Leapfrog's calculator! If you know how to write ``[Au] * 2`` in Leapfrog, you can use it in Pollywog.
pt_br: Note que expressões no Pollywog usam **exatamente a mesma sintaxe** da calculadora do Leapfrog! Se você sabe escrever ``[Au] * 2`` no Leapfrog, você pode usá-lo no Pollywog.

source: Multiple Calculations: The CalcSet
pt_br: Múltiplos Cálculos: O CalcSet

source: You'd create each calculation one by one:
pt_br: Você criaria cada cálculo um por um:

source: **Key concept:** ``CalcSet([...])`` is a container holding multiple calculations. The square brackets ``[...]`` create a list of calculations.
pt_br: **Conceito-chave:** ``CalcSet([...])`` é um container que mantém múltiplos cálculos. Os colchetes ``[...]`` criam uma lista de cálculos.

source: Understanding Variable vs Number vs Category
pt_br: Entendendo Variable vs Number vs Category

source: Pollywog has three types of calculation items. Understanding when to use each is important.
pt_br: Pollywog tem três tipos de itens de cálculo. Entender quando usar cada um é importante.

source: Visible in Leapfrog's calculator UI
pt_br: Visível na interface da calculadora do Leapfrog

source: **NOT available** outside the calculator (can't visualize in 3D, can't use in other Leapfrog tools)
pt_br: **NÃO disponível** fora da calculadora (não pode visualizar em 3D, não pode usar em outras ferramentas do Leapfrog)

source: Use for **intermediate steps** you need for calculations but won't visualize or export
pt_br: Use para **etapas intermediárias** que você precisa para cálculos mas não vai visualizar ou exportar

source: Can hold numeric or categorical values
pt_br: Pode conter valores numéricos ou categóricos

source: **Available everywhere** (can visualize, export, use in other tools)
pt_br: **Disponível em todos os lugares** (pode visualizar, exportar, usar em outras ferramentas)

source: Use for **final numeric outputs** you want to work with
pt_br: Use para **saídas numéricas finais** com as quais você quer trabalhar

source: Examples: composite grades, recoveries, NSR values
pt_br: Exemplos: teores compostos, recuperações, valores NSR

source: Use for **final categorical outputs** like classifications
pt_br: Use para **saídas categóricas finais** como classificações

source: Examples: ore/waste, domain names, rock types
pt_br: Exemplos: minério/estéril, nomes de domínios, tipos de rocha

source: **Quick decision guide:**
pt_br: **Guia rápido de decisão:**

source: **Example showing the difference:**
pt_br: **Exemplo mostrando a diferença:**

source: In Leapfrog's calculator, you'll see all 4 items. But only ``Au_kriged`` is available for 3D visualization, exporting to CSV, or using in other Leapfrog tools. The Variables exist only within the calculator context.
pt_br: Na calculadora do Leapfrog, você verá todos os 4 itens. Mas apenas ``Au_kriged`` está disponível para visualização 3D, exportação para CSV ou uso em outras ferramentas do Leapfrog. As Variables existem apenas dentro do contexto da calculadora.

source: **Why use Variables?**
pt_br: **Por que usar Variables?**

source: Conditional Calculations
pt_br: Cálculos Condicionais

source: Name: ``ore_class``
pt_br: Nome: ``ore_class``

source: Expression: ``if([Au] >= 0.5, "ore", "waste")``
pt_br: Expressão: ``if([Au] >= 0.5, "ore", "waste")``

source: Type: Category
pt_br: Tipo: Category

source: **Important notes:**
pt_br: **Notas importantes:**

source: Use ``Category`` for text outputs (like "ore" or "waste")
pt_br: Use ``Category`` para saídas de texto (como "ore" ou "waste")

source: Use ``Number`` for numeric outputs (like ``1.5`` or ``0.88``)
pt_br: Use ``Number`` para saídas numéricas (como ``1.5`` ou ``0.88``)

source: The expression must be in square brackets: ``expression=[If(...)]``
pt_br: A expressão deve estar entre colchetes: ``expression=[If(...)]``

source: Text values need quotes inside quotes: ``"'ore'"`` (outer for Python, inner for Leapfrog)
pt_br: Valores de texto precisam de aspas dentro de aspas: ``"'ore'"`` (externa para Python, interna para Leapfrog)

source: Graduated Examples: Learning by Doing
pt_br: Exemplos Graduados: Aprendendo Fazendo

source: Let's work through real-world examples, starting simple and building up. Each example builds on skills from the previous ones.
pt_br: Vamos trabalhar exemplos do mundo real, começando simples e evoluindo. Cada exemplo se baseia em habilidades dos anteriores.

source: Level 1: Single Simple Calculation
pt_br: Nível 1: Cálculo Simples Único

source: **Goal:** Remove negative gold values.
pt_br: **Objetivo:** Remover valores negativos de ouro.

source: ✓ Download the file and import into Leapfrog to verify it works!
pt_br: ✓ Baixe o arquivo e importe no Leapfrog para verificar que funciona!

source: Level 2: Chain of Calculations
pt_br: Nível 2: Cadeia de Cálculos

source: **Goal:** Clean data through multiple steps.
pt_br: **Objetivo:** Limpar dados através de múltiplas etapas.

source: **Notice:** ``Au_capped`` references ``[Au_clean]``, and ``Au_log`` references ``[Au_capped]``. Pollywog handles the dependency order automatically.
pt_br: **Note:** ``Au_capped`` referencia ``[Au_clean]``, e ``Au_log`` referencia ``[Au_capped]``. Pollywog trata a ordem de dependências automaticamente.

source: Level 3: Using Variables for Intermediate Steps
pt_br: Nível 3: Usando Variables para Etapas Intermediárias

source: **Goal:** Same as Level 2, but keep Leapfrog interface clean.
pt_br: **Objetivo:** Mesmo que o Nível 2, mas manter a interface do Leapfrog limpa.

source: **Compare:** When you import this, you'll only see ``Au_kriged`` available for visualization. The cleaning steps exist in the calculator but don't clutter your block model interface.
pt_br: **Compare:** Quando você importa isso, você verá apenas ``Au_kriged`` disponível para visualização. As etapas de limpeza existem na calculadora mas não poluem a interface do seu modelo de blocos.

source: Level 4: Weighted Average (One Metal)
pt_br: Nível 4: Média Ponderada (Um Metal)

source: **Goal:** Calculate domain-weighted gold grade.
pt_br: **Objetivo:** Calcular teor de ouro ponderado por domínio.

source: **What ``WeightedAverage`` does:** It creates the formula ``([Au_oxide] * [prop_oxide] + [Au_transition] * [prop_transition] + [Au_sulfide] * [prop_sulfide]) / ([prop_oxide] + [prop_transition] + [prop_sulfide])`` for you. Much easier than typing that out!
pt_br: **O que ``WeightedAverage`` faz:** Cria a fórmula ``([Au_oxide] * [prop_oxide] + [Au_transition] * [prop_transition] + [Au_sulfide] * [prop_sulfide]) / ([prop_oxide] + [prop_transition] + [prop_sulfide])`` para você. Muito mais fácil do que digitar isso tudo!

source: Level 5: Multiple Weighted Averages
pt_br: Nível 5: Múltiplas Médias Ponderadas

source: **Goal:** Create weighted composites for Au, Ag, and Cu.
pt_br: **Objetivo:** Criar compostos ponderados para Au, Ag e Cu.

source: **Version A: Write them all out** (recommended while learning)
pt_br: **Versão A: Escrever todos** (recomendado enquanto aprende)

source: This is clear and explicit. If you have 3-5 metals, this approach works great!
pt_br: Isso é claro e explícito. Se você tem 3-5 metais, essa abordagem funciona muito bem!

source: **Version B: Let Python do the repetition** (for when you have many metals)
pt_br: **Versão B: Deixar o Python fazer a repetição** (para quando você tem muitos metais)

source: If you have 10 metals, writing them all out gets tedious. Here's where Python shines:
pt_br: Se você tem 10 metais, escrever todos fica tedioso. Aqui é onde Python brilha:

source: Both versions create the same .lfcalc file! Use Version A until you're comfortable, then learn Version B when you're ready to scale up. We'll explain how the automation works in the "Common Patterns" section later.
pt_br: Ambas as versões criam o mesmo arquivo .lfcalc! Use a Versão A até você estar confortável, depois aprenda a Versão B quando estiver pronto para escalar. Vamos explicar como a automação funciona na seção "Padrões Comuns" mais tarde.

source: Level 6: Classification with Thresholds
pt_br: Nível 6: Classificação com Limites

source: **Goal:** Classify blocks by gold grade into waste, low grade, and high grade.
pt_br: **Objetivo:** Classificar blocos por teor de ouro em estéril, baixo teor e alto teor.

source: **How it works:**
pt_br: **Como funciona:**

source: Au < 0.3: waste
pt_br: Au < 0.3: estéril

source: 0.3 ≤ Au < 1.0: low_grade
pt_br: 0.3 ≤ Au < 1.0: baixo_teor

source: Au ≥ 1.0: high_grade
pt_br: Au ≥ 1.0: alto_teor

source: You need **one more category than thresholds**. Here: 2 thresholds → 3 categories.
pt_br: Você precisa de **uma categoria a mais do que limites**. Aqui: 2 limites → 3 categorias.

source: Level 7: Conditional Logic with If
pt_br: Nível 7: Lógica Condicional com If

source: **Goal:** Apply different recovery rates depending on domain.
pt_br: **Objetivo:** Aplicar diferentes taxas de recuperação dependendo do domínio.

source: **Notice:** The expression is wrapped in ``[If(...)]`` (a list containing one If structure).
pt_br: **Note:** A expressão está envolvida em ``[If(...)]`` (uma lista contendo uma estrutura If).

source: Level 8: Complete Workflow
pt_br: Nível 8: Fluxo de Trabalho Completo

source: **Goal:** Realistic workflow with composites, recovery, economics, and classification.
pt_br: **Objetivo:** Fluxo de trabalho realista com compostos, recuperação, economia e classificação.

source: 🎉 **Milestone!** If you've made it this far and successfully created this workflow, you're already more productive than doing it manually in Leapfrog. Everything from here is building on these foundations.
pt_br: **Marco importante!** Se você chegou até aqui e criou com sucesso este fluxo de trabalho, você já é mais produtivo do que fazendo manualmente no Leapfrog. Tudo a partir daqui é construir sobre essas fundações.

source: Reading and Modifying Existing Files
pt_br: Lendo e Modificando Arquivos Existentes
