Repository: endarthur/pollywog
Catalog: docs/locale/*/LC_MESSAGES/geologist_tutorial.po
Languages: pt_br

source: In real projects, you'll often need to read existing .lfcalc files, inspect them, modify them, or add new calculations.
pt_br: Em projetos reais, você frequentemente precisará ler arquivos .lfcalc existentes, inspecioná-los, modificá-los ou adicionar novos cálculos.

source: Reading a .lfcalc File
pt_br: Lendo um Arquivo .lfcalc

source: Inspecting Calculations
pt_br: Inspecionando Cálculos

source: Modifying Existing Calculations
pt_br: Modificando Cálculos Existentes

source: Adding New Calculations
pt_br: Adicionando Novos Cálculos

source: Debugging and Testing Your Calculations
pt_br: Depurando e Testando Seus Cálculos

source: When things don't work as expected, here's how to find and fix issues.
pt_br: Quando as coisas não funcionam como esperado, veja como encontrar e corrigir problemas.

source: Common Python Errors
pt_br: Erros Comuns de Python

source: You have a typo or missing punctuation.
pt_br: Você tem um erro de digitação ou pontuação faltando.

source: Common causes:
pt_br: Causas comuns:

source: Missing comma between items in a list
pt_br: Vírgula faltando entre itens em uma lista

source: Missing closing parenthesis or bracket
pt_br: Parêntese ou colchete de fechamento faltando

source: Missing quote mark
pt_br: Aspas faltando

source: **Fix:** Look at the line number in the error. Check for missing commas, brackets, or quotes.
pt_br: **Correção:** Olhe o número da linha no erro. Verifique por vírgulas, colchetes ou aspas faltando.

source: Example:
pt_br: Exemplo:

source: You forgot to import.
pt_br: Você esqueceu de importar.

source: **Fix:** Add at the top of your notebook:
pt_br: **Correção:** Adicione no topo do seu notebook:

source: You passed the wrong type or number of values to a function.
pt_br: Você passou o tipo ou número errado de valores para uma função.

source: **Fix:** Check the error message carefully—it usually tells you what's wrong. Common issues:
pt_br: **Correção:** Verifique a mensagem de erro cuidadosamente—ela geralmente diz o que está errado. Problemas comuns:

source: Wrong number of categories vs thresholds (need N+1 categories for N thresholds)
pt_br: Número errado de categorias vs limites (precisa de N+1 categorias para N limites)

source: Empty lists where values are expected
pt_br: Listas vazias onde valores são esperados

source: Mixing up parameter order
pt_br: Confundindo a ordem dos parâmetros

source: Common Leapfrog Issues
pt_br: Problemas Comuns do Leapfrog

source: **Your calculation imports but gives wrong results:**
pt_br: **Seu cálculo importa mas dá resultados errados:**

source: **Checklist:**
pt_br: **Lista de verificação:**

source: **Variable names match exactly** (case-sensitive!): ``[Au]`` ≠ ``[au]``
pt_br: **Nomes de variáveis coincidem exatamente** (sensível a maiúsculas!): ``[Au]`` ≠ ``[au]``

source: **Square brackets around variables**: ``[Au] * 2`` not ``Au * 2``
pt_br: **Colchetes ao redor de variáveis**: ``[Au] * 2`` não ``Au * 2``

source: **Quotes for category values**: ``"'ore'"`` not ``"ore"``
pt_br: **Aspas para valores de categoria**: ``"'ore'"`` não ``"ore"``

source: **Units are consistent**: g/t vs %, oz/ton vs g/t, $/oz vs $/lb
pt_br: **Unidades são consistentes**: g/t vs %, oz/ton vs g/t, $/oz vs $/lb

source: **Null/missing data handled**: Use ``coalesce([Au], 0)`` to replace nulls
pt_br: **Dados nulos/faltantes tratados**: Use ``coalesce([Au], 0)`` para substituir nulos

source: **Your calculation doesn't appear where expected:**
pt_br: **Seu cálculo não aparece onde esperado:**

source: Check if you used ``Variable`` (calculator only) vs ``Number``/``Category`` (available everywhere)
pt_br: Verifique se você usou ``Variable`` (apenas calculadora) vs ``Number``/``Category`` (disponível em todos os lugares)

source: Variables won't show up for 3D visualization or export
pt_br: Variables não aparecem para visualização 3D ou exportação

source: Testing Strategies
pt_br: Estratégias de Teste

source: **Create a simple test case:**
pt_br: **Crie um caso de teste simples:**

source: Import to Leapfrog and verify ``test_result`` equals 1.32. If not, your formula has an issue.
pt_br: Importe no Leapfrog e verifique que ``test_result`` é igual a 1.32. Se não, sua fórmula tem um problema.

source: **Test with edge cases:**
pt_br: **Teste com casos extremos:**

source: **Verification workflow:**
pt_br: **Fluxo de verificação:**

source: Create calculation with Pollywog
pt_br: Criar cálculo com Pollywog

source: Export to .lfcalc
pt_br: Exportar para .lfcalc

source: Import to Leapfrog
pt_br: Importar no Leapfrog

source: Check a few blocks with known values
pt_br: Verificar alguns blocos com valores conhecidos

source: Export results to CSV
pt_br: Exportar resultados para CSV

source: Spot-check in Excel
pt_br: Verificação pontual no Excel

source: Compare against previous model (if updating)
pt_br: Comparar com modelo anterior (se atualizando)

source: Common Patterns Explained
pt_br: Padrões Comuns Explicados

source: As you use Pollywog, you'll see some patterns repeat. Here are the most common ones.
pt_br: Conforme você usa o Pollywog, você verá alguns padrões se repetirem. Aqui estão os mais comuns.

source: F-Strings: Text Templates
pt_br: F-Strings: Templates de Texto

source: F-strings let you insert variable values into text. Very useful for creating many similar names.
pt_br: F-strings permitem você inserir valores de variáveis em texto. Muito útil para criar muitos nomes similares.

source: **Practical use:**
pt_br: **Uso prático:**

source: List Comprehensions: Automation
pt_br: List Comprehensions: Automação

source: List comprehensions create lists by repeating a pattern. This is Python's way of doing "for each item, do this."
pt_br: List comprehensions criam listas repetindo um padrão. Esta é a forma do Python de fazer "para cada item, faça isso."

source: **Basic pattern:**
pt_br: **Padrão básico:**

source: **Think of it as:** "For each metal in my list, create a name using this pattern."
pt_br: **Pense nisso como:** "Para cada metal na minha lista, crie um nome usando este padrão."

source: This creates 5 weighted averages (one for each metal) automatically!
pt_br: Isso cria 5 médias ponderadas (uma para cada metal) automaticamente!

source: The Unpacking Operator (*)
pt_br: O Operador de Desempacotamento (*)

source: The ``*`` unpacks a list, putting each item directly where you use it.
pt_br: O ``*`` desempacota uma lista, colocando cada item diretamente onde você o usa.

source: **Why you need it:**
pt_br: **Por que você precisa dele:**

source: **Think of it as:** "Unpack this list and put each item directly here."
pt_br: **Pense nisso como:** "Desempacote esta lista e coloque cada item diretamente aqui."

source: Named Parameters
pt_br: Parâmetros Nomeados

source: Functions in Pollywog often use named parameters for clarity.
pt_br: Funções no Pollywog frequentemente usam parâmetros nomeados para clareza.

source: **Benefits of named parameters:**
pt_br: **Benefícios de parâmetros nomeados:**

source: Makes code more readable
pt_br: Torna o código mais legível

source: Can put parameters in any order
pt_br: Pode colocar parâmetros em qualquer ordem

source: Can skip optional parameters
pt_br: Pode pular parâmetros opcionais

source: Easy to see what each value means
pt_br: Fácil ver o que cada valor significa

source: Common Mistakes and How to Fix Them
pt_br: Erros Comuns e Como Corrigi-los

source: Everyone makes mistakes when learning. Here are the most common ones.
pt_br: Todo mundo comete erros ao aprender. Aqui estão os mais comuns.

source: Mistake 1: Forgetting Square Brackets
pt_br: Erro 1: Esquecer Colchetes

source: **Error:**
pt_br: **Erro:**

source: **Problem:** In Leapfrog expressions, variable references need square brackets.
pt_br: **Problema:** Em expressões do Leapfrog, referências a variáveis precisam de colchetes.

source: **Fix:**
pt_br: **Correção:**

source: Mistake 2: Quote Confusion in Categories
pt_br: Erro 2: Confusão de Aspas em Categorias

source: **Problem:** Category values need to be quoted in the Leapfrog expression.
pt_br: **Problema:** Valores de categoria precisam estar entre aspas na expressão do Leapfrog.

source: **Remember:** Use ``"'text'"`` (double quotes outside, single quotes inside) for category values.
pt_br: **Lembre-se:** Use ``"'text'"`` (aspas duplas fora, aspas simples dentro) para valores de categoria.

source: Mistake 3: Forgetting to Import
pt_br: Erro 3: Esquecer de Importar

source: **Problem:** You need to import before you can use Pollywog classes.
pt_br: **Problema:** Você precisa importar antes de poder usar classes do Pollywog.

source: Mistake 4: Missing Commas in Lists
pt_br: Erro 4: Vírgulas Faltando em Listas

source: **Problem:** Python lists need commas between items.
pt_br: **Problema:** Listas Python precisam de vírgulas entre itens.

source: Mistake 5: Using Number for Categories
pt_br: Erro 5: Usar Number para Categorias

source: **Problem:** Numbers can't hold text values.
pt_br: **Problema:** Numbers não podem conter valores de texto.

source: **Rule:** Use ``Number`` for numeric results, ``Category`` for text results.
pt_br: **Regra:** Use ``Number`` para resultados numéricos, ``Category`` para resultados de texto.

source: Mistake 6: Wrong Number of Categories vs Thresholds
pt_br: Erro 6: Número Errado de Categorias vs Limites

source: **Problem:** Need one more category than thresholds.
pt_br: **Problema:** Precisa de uma categoria a mais do que limites.

source: Mistake 7: Variable vs Number Confusion
pt_br: Erro 7: Confusão entre Variable e Number

source: **Problem:** Variables aren't available outside the calculator.
pt_br: **Problema:** Variables não estão disponíveis fora da calculadora.

source: Best Practices
pt_br: Melhores Práticas

source: Commenting Your Work
pt_br: Comentando Seu Trabalho

source: Add comments to document your logic—your future self will thank you!
pt_br: Adicione comentários para documentar sua lógica—seu eu futuro agradecerá!

source: Use Variables for Intermediate Steps
pt_br: Use Variables para Etapas Intermediárias

source: Keep your Leapfrog interface clean by using Variables for calculations you won't visualize.
pt_br: Mantenha sua interface do Leapfrog limpa usando Variables para cálculos que você não vai visualizar.

source: Organize with Markdown Cells
pt_br: Organize com Células Markdown

source: Use markdown cells in your notebooks to explain what each section does:
pt_br: Use células markdown em seus notebooks para explicar o que cada seção faz:

source: Test Before Scaling Up
pt_br: Teste Antes de Escalar

source: When creating many calculations with loops:
pt_br: Ao criar muitos cálculos com loops:

source: Test with 1-2 items first
pt_br: Teste com 1-2 itens primeiro

source: Verify in Leapfrog
pt_br: Verifique no Leapfrog

source: Then scale up to full list
pt_br: Então escale para a lista completa

source: Version Your Files
pt_br: Versione Seus Arquivos

source: Keep track of changes by using version numbers or dates in filenames:
pt_br: Acompanhe mudanças usando números de versão ou datas em nomes de arquivo:

source: When to Use Pollywog vs Manual
pt_br: Quando Usar Pollywog vs Manual

source: **Use Pollywog when:**
pt_br: **Use Pollywog quando:**

source: Creating >10 similar calculations
pt_br: Criando >10 cálculos similares

source: Need to update many calculations at once
pt_br: Precisa atualizar muitos cálculos de uma vez

source: Want version control for workflows
pt_br: Quer controle de versão para fluxos de trabalho

source: Reusing patterns across projects
pt_br: Reutilizando padrões entre projetos

source: Automating repetitive work
pt_br: Automatizando trabalho repetitivo

source: **Use Leapfrog's Calculator when:**
pt_br: **Use a Calculadora do Leapfrog quando:**

source: One-off custom calculation
pt_br: Cálculo customizado único

source: Experimental/exploratory work
pt_br: Trabalho experimental/exploratório

source: Very simple single calculation
pt_br: Cálculo único muito simples

source: Still learning the pattern
pt_br: Ainda aprendendo o padrão

source: **The sweet spot:** Use both! Prototype in Leapfrog's calculator, then convert to Pollywog when you need to scale or reuse.
pt_br: **O ponto ideal:** Use ambos! Faça protótipos na calculadora do Leapfrog, depois converta para Pollywog quando precisar escalar ou reutilizar.

source: Downloading Files from JupyterLite
pt_br: Baixando Arquivos do JupyterLite

source: You have two options to download your .lfcalc files:
pt_br: Você tem duas opções para baixar seus arquivos .lfcalc:

source: Option 1: Enable Autodownload Magic (Recommended)
pt_br: Opção 1: Habilitar Magic de Autodownload (Recomendado)

source: At the top of your notebook, run:
pt_br: No topo do seu notebook, execute:

source: Now when you run ``to_lfcalc()``, a download button appears below the cell. Click it to save the file.
pt_br: Agora quando você executa ``to_lfcalc()``, um botão de download aparece abaixo da célula. Clique nele para salvar o arquivo.

source: Option 2: Manual Download
pt_br: Opção 2: Download Manual

source: In JupyterLite's file browser (left side), right-click on your ``.lfcalc`` file and select "Download".
pt_br: No navegador de arquivos do JupyterLite (lado esquerdo), clique com o botão direito no seu arquivo ``.lfcalc`` e selecione "Download".

source: Tips for Success
pt_br: Dicas para Sucesso

source: **Start small:** Begin with 2-3 calculations and get comfortable before tackling complex workflows
pt_br: **Comece pequeno:** Comece com 2-3 cálculos e fique confortável antes de enfrentar fluxos de trabalho complexos

source: **Test frequently:** Export and test in Leapfrog often to catch issues early
pt_br: **Teste frequentemente:** Exporte e teste no Leapfrog frequentemente para pegar problemas cedo

source: **Use comments:** Add ``comment_equation`` to document your logic
pt_br: **Use comentários:** Adicione ``comment_equation`` para documentar sua lógica

source: **Copy examples:** There's no shame in copying working code and modifying it—that's how everyone learns!
pt_br: **Copie exemplos:** Não há vergonha em copiar código que funciona e modificá-lo—é assim que todo mundo aprende!

source: **Build a library:** Save your successful scripts for reuse on future projects
pt_br: **Construa uma biblioteca:** Salve seus scripts bem-sucedidos para reutilização em futuros projetos

source: **Use markdown cells:** Document what each section of your notebook does
pt_br: **Use células markdown:** Documente o que cada seção do seu notebook faz

source: **Keep it readable:** If a formula gets too complex, break it into Variables
pt_br: **Mantenha legível:** Se uma fórmula fica muito complexa, divida-a em Variables

source: **Ask for help:** If you're stuck, check the documentation or ask Python-savvy colleagues
pt_br: **Peça ajuda:** Se você está travado, verifique a documentação ou pergunte a colegas experientes em Python

source: Saving and Organizing Your Work
pt_br: Salvando e Organizando Seu Trabalho

source: In JupyterLite
pt_br: No JupyterLite

source: **Remember:** JupyterLite stores everything in browser memory!
pt_br: **Lembre-se:** JupyterLite armazena tudo na memória do navegador!

source: **Best practices:**
pt_br: **Melhores práticas:**

source: Download your notebooks regularly (File → Download)
pt_br: Baixe seus notebooks regularmente (File → Download)

source: Download .lfcalc files immediately after creating them
pt_br: Baixe arquivos .lfcalc imediatamente após criá-los

source: Keep backups on your computer or network drive
pt_br: Mantenha backups no seu computador ou drive de rede

source: Consider one notebook per project or workflow stage
pt_br: Considere um notebook por projeto ou etapa de fluxo de trabalho

source: Clear browser cache carefully (you'll lose unsaved work!)
pt_br: Limpe o cache do navegador com cuidado (você perderá trabalho não salvo!)

source: On Your Computer
pt_br: No Seu Computador

source: If you install Python and Pollywog locally (see :doc:`getting_started`), you can:
pt_br: Se você instalar Python e Pollywog localmente (veja :doc:`getting_started`), você pode:

source: Save notebooks and scripts directly to your file system
pt_br: Salvar notebooks e scripts diretamente no seu sistema de arquivos

source: Use version control (Git) to track changes
pt_br: Usar controle de versão (Git) para rastrear mudanças

source: Integrate with your company's data management systems
pt_br: Integrar com os sistemas de gerenciamento de dados da sua empresa

source: Better performance for large calculation sets
pt_br: Melhor desempenho para grandes conjuntos de cálculos

source: Next Steps
pt_br: Próximos Passos

source: Now that you understand the basics:
pt_br: Agora que você entende o básico:

source: Practice Projects
pt_br: Projetos de Prática

source: Recreate a simple calculation set from one of your Leapfrog projects
pt_br: Recrie um conjunto de cálculos simples de um dos seus projetos Leapfrog

source: Build domain-weighted composites for your most common metals
pt_br: Construa compostos ponderados por domínio para seus metais mais comuns

source: Create a classification system for your typical ore types
pt_br: Crie um sistema de classificação para seus tipos de minério típicos

source: Add economic calculations (recovery, metal prices, NSR)
pt_br: Adicione cálculos econômicos (recuperação, preços de metais, NSR)

source: Learn More
pt_br: Aprenda Mais

source: :doc:`getting_started` - Installing Pollywog on your computer
pt_br: :doc:`getting_started` - Instalando Pollywog no seu computador

source: :doc:`tutorials` - More detailed workflow examples
pt_br: :doc:`tutorials` - Exemplos de fluxo de trabalho mais detalhados

source: :doc:`expression_syntax` - Complete guide to Leapfrog expression syntax
pt_br: :doc:`expression_syntax` - Guia completo de sintaxe de expressões do Leapfrog

source: :doc:`helpers_guide` - All available helper functions
pt_br: :doc:`helpers_guide` - Todas as funções auxiliares disponíveis

source: :doc:`workflow_patterns` - Common patterns for different scenarios
pt_br: :doc:`workflow_patterns` - Padrões comuns para diferentes cenários

source: Advanced Topics (For Later)
pt_br: Tópicos Avançados (Para Depois)

source: Converting Excel formulas to Pollywog
pt_br: Convertendo fórmulas do Excel para Pollywog

source: Building calculation templates for your company
pt_br: Construindo templates de cálculo para sua empresa

source: Integrating machine learning models
pt_br: Integrando modelos de machine learning

source: Automating complete workflows
pt_br: Automatizando fluxos de trabalho completos

source: Getting Help
pt_br: Obtendo Ajuda

source: If you get stuck:
pt_br: Se você ficar travado:

source: **Check the examples:** The ``examples/`` folder in the GitHub repository has working notebooks
pt_br: **Verifique os exemplos:** A pasta ``examples/`` no repositório GitHub tem notebooks funcionando

source: **Read the documentation:** https://pollywog.readthedocs.io
pt_br: **Leia a documentação:** https://pollywog.readthedocs.io

source: **Search for similar issues:** https://github.com/endarthur/pollywog/issues
pt_br: **Procure por problemas similares:** https://github.com/endarthur/pollywog/issues

source: **Ask questions:** Open a new issue on GitHub
pt_br: **Faça perguntas:** Abra uma nova issue no GitHub

source: The Pollywog community is friendly and helpful. Don't be afraid to ask questions!
pt_br: A comunidade do Pollywog é amigável e prestativa. Não tenha medo de fazer perguntas!

source: Final Thoughts
pt_br: Considerações Finais

source: Learning Python and Pollywog might feel challenging at first, but remember:
pt_br: Aprender Python e Pollywog pode parecer desafiador no início, mas lembre-se:

source: You already understand the concepts (you use Leapfrog's calculator!)
pt_br: Você já entende os conceitos (você usa a calculadora do Leapfrog!)

source: You're just learning a new way to express the same ideas
pt_br: Você está apenas aprendendo uma nova forma de expressar as mesmas ideias

source: The time investment pays off quickly—often after just one project
pt_br: O investimento de tempo compensa rapidamente—frequentemente após apenas um projeto

source: Every resource geologist who learns this says: "I wish I'd learned it sooner"
pt_br: Todo geólogo de recursos que aprende isso diz: "Eu gostaria de ter aprendido antes"

source: Start with simple examples, build confidence, and gradually tackle more complex workflows. Before you know it, you'll be automating calculations that used to take hours.
pt_br: Comece com exemplos simples, construa confiança e gradualmente enfrente fluxos de trabalho mais complexos. Antes que você perceba, você estará automatizando cálculos que costumavam levar horas.

source: **You've got this!** 🪨✨
pt_br: **Você consegue!**
