Repository: endarthur/pollywog
Catalog: docs/locale/*/LC_MESSAGES/index.po
Languages: pt_br

source: Getting Started
pt_br: Primeiros Passos

source: User Guide
pt_br: Guia do Usuário

source: Reference
pt_br: Referência

source: Welcome to pollywog's documentation!
pt_br: Bem-vindo à documentação do pollywog!

source: **Choose your learning path:**
pt_br: **Escolha seu caminho de aprendizado:**

source: **Python users**: Start with :doc:`getting_started` for a quick overview
pt_br: **Usuários de Python**: Comece com :doc:`getting_started` para uma visão geral rápida

source: **Geologists new to Python**: Start with :doc:`geologist_tutorial` for step-by-step guidance
pt_br: **Geólogos novos em Python**: Comece com :doc:`geologist_tutorial` para orientação passo a passo

source: **Advanced workflows**: See :doc:`tutorials` for complete project examples
pt_br: **Fluxos de trabalho avançados**: Veja :doc:`tutorials` para exemplos completos de projetos

source: Introduction
pt_br: Introdução

source: **pollywog** is a Python library designed to make it easy to build, manipulate, and visually inspect Leapfrog-style calculation sets—especially when those sets are large, complex, or involve repetitive logic.
pt_br: **pollywog** é uma biblioteca Python projetada para facilitar a construção, manipulação e inspeção visual de conjuntos de cálculos no estilo Leapfrog—especialmente quando esses conjuntos são grandes, complexos ou envolvem lógica repetitiva.

source: When to Use Pollywog
pt_br: Quando Usar o Pollywog

source: What is Leapfrog?
pt_br: O que é Leapfrog?

source: `Leapfrog <https://www.seequent.com/products-solutions/leapfrog-geo/>`_ is industry-leading 3D geological modeling software developed by Seequent. It is widely used in mining and resource estimation for:
pt_br: `Leapfrog <https://www.seequent.com/products-solutions/leapfrog-geo/>`_ é um software líder de mercado para modelagem geológica 3D desenvolvido pela Seequent. É amplamente usado em mineração e estimativa de recursos para:

source: **Drillhole database management** and visualization
pt_br: **Gerenciamento de banco de dados de furos de sondagem** e visualização

source: **Geological modeling** (surfaces, solids, block models)
pt_br: **Modelagem geológica** (superfícies, sólidos, modelos de blocos)

source: **Grade estimation** (kriging, IDW, nearest neighbor) with Leapfrog Edge
pt_br: **Estimativa de teor** (krigagem, IDW, vizinho mais próximo) com Leapfrog Edge

source: **Resource and reserve calculation**
pt_br: **Cálculo de recursos e reservas**

source: Leapfrog uses **calculation sets** (``.lfcalc`` files) to define formulas and transformations applied to data. These calculations can become complex when dealing with multiple domains, conditional logic, and multi-commodity resources.
pt_br: O Leapfrog usa **conjuntos de cálculos** (arquivos ``.lfcalc``) para definir fórmulas e transformações aplicadas aos dados. Esses cálculos podem se tornar complexos ao lidar com múltiplos domínios, lógica condicional e recursos multi-commodities.

source: Why pollywog?
pt_br: Por que pollywog?

source: **Problems pollywog solves:**
pt_br: **Problemas que o pollywog resolve:**

source: Challenge
pt_br: Desafio

source: Solution
pt_br: Solução

source: 📝 **Large calculation sets**
pt_br: 📝 **Grandes conjuntos de cálculos**

source: Generate hundreds of calculations programmatically instead of point-and-click
pt_br: Gere centenas de cálculos programaticamente em vez de apontar e clicar

source: 🔀 **Complex logic**
pt_br: 🔀 **Lógica complexa**

source: Use Python's control flow (loops, conditionals) to build calculations
pt_br: Use o fluxo de controle do Python (loops, condicionais) para construir cálculos

source: 🔁 **Repetitive tasks**
pt_br: 🔁 **Tarefas repetitivas**

source: Automate patterns with helper functions and templates
pt_br: Automatize padrões com funções auxiliares e templates

source: 🔍 **Hard to review**
pt_br: 🔍 **Difícil de revisar**

source: Display calculation trees interactively in Jupyter notebooks
pt_br: Exiba árvores de cálculo interativamente em notebooks Jupyter

source: 🤖 **ML integration**
pt_br: 🤖 **Integração com ML**

source: Deploy scikit-learn models directly as Leapfrog calculations
pt_br: Implante modelos scikit-learn diretamente como cálculos do Leapfrog

source: 📋 **Version control**
pt_br: 📋 **Controle de versão**

source: Keep calculation logic in Git-trackable Python scripts
pt_br: Mantenha a lógica de cálculo em scripts Python rastreáveis pelo Git

source: 🧪 **Testing**
pt_br: 🧪 **Testes**

source: Write unit tests for calculation logic before deploying
pt_br: Escreva testes unitários para a lógica de cálculo antes de implantar

source: **By using pollywog, you can:**
pt_br: **Usando o pollywog, você pode:**

source: ✅ Automate creation and modification of calculation sets
pt_br: ✅ Automatizar a criação e modificação de conjuntos de cálculos

source: ✅ Refactor and query calculations with code
pt_br: ✅ Refatorar e consultar cálculos com código

source: ✅ Export directly to Leapfrog ``.lfcalc`` format
pt_br: ✅ Exportar diretamente para o formato ``.lfcalc`` do Leapfrog

source: ✅ Visualize and validate logic interactively
pt_br: ✅ Visualizar e validar a lógica interativamente

source: ✅ Deploy machine learning models in resource models
pt_br: ✅ Implantar modelos de machine learning em modelos de recursos

source: ✅ Maintain calculation logic in version-controlled scripts
pt_br: ✅ Manter a lógica de cálculo em scripts com controle de versão

source: Quick Example
pt_br: Exemplo Rápido

source: Here's a simple example showing pollywog's power – creating a complete resource estimation postprocessing workflow in just a few lines:
pt_br: Aqui está um exemplo simples mostrando o poder do pollywog – criando um fluxo de trabalho completo de pós-processamento de estimativa de recursos em apenas algumas linhas:

source: **Compare this to manually creating 6+ calculations in Leapfrog's UI!** 🎉
pt_br: **Compare isso com a criação manual de mais de 6 cálculos na interface do Leapfrog!** 🎉

source: This example creates 6 calculations that would take 10-15 minutes to build manually in Leapfrog. With pollywog, it takes seconds and is version-controlled, testable, and reusable!
pt_br: Este exemplo cria 6 cálculos que levariam 10-15 minutos para construir manualmente no Leapfrog. Com o pollywog, leva segundos e é versionado, testável e reutilizável!

source: Key Features
pt_br: Recursos Principais

source: **Core Functionality:**
pt_br: **Funcionalidade Principal:**

source: Read and write Leapfrog ``.lfcalc`` files
pt_br: Ler e escrever arquivos ``.lfcalc`` do Leapfrog

source: Programmatically create calculations with ``Number``, ``Category``, ``Variable``, and ``Filter`` types
pt_br: Criar cálculos programaticamente com tipos ``Number``, ``Category``, ``Variable`` e ``Filter``

source: Build conditional logic with ``If``/``Else`` statements
pt_br: Construir lógica condicional com instruções ``If``/``Else``

source: Query and filter calculation sets like pandas DataFrames
pt_br: Consultar e filtrar conjuntos de cálculos como DataFrames do pandas

source: **Helper Functions:**
pt_br: **Funções Auxiliares:**

source: ``Sum``, ``Product``, ``Average`` - Basic mathematical operations
pt_br: ``Sum``, ``Product``, ``Average`` - Operações matemáticas básicas

source: ``WeightedAverage`` - Domain proportion weighting
pt_br: ``WeightedAverage`` - Ponderação por proporção de domínio

source: ``Scale``, ``Normalize`` - Data transformations
pt_br: ``Scale``, ``Normalize`` - Transformações de dados

source: ``CategoryFromThresholds`` - Threshold-based classification
pt_br: ``CategoryFromThresholds`` - Classificação baseada em limites

source: Convert scikit-learn decision trees to calculations
pt_br: Converter árvores de decisão do scikit-learn em cálculos

source: Convert random forests to calculation ensembles
pt_br: Converter florestas aleatórias em conjuntos de cálculos

source: Convert linear models to equations
pt_br: Converter modelos lineares em equações

source: Full support for both regression and classification
pt_br: Suporte completo para regressão e classificação

source: **Advanced Features:**
pt_br: **Recursos Avançados:**

source: Topological sorting for dependency resolution
pt_br: Ordenação topológica para resolução de dependências

source: Dependency analysis and visualization
pt_br: Análise e visualização de dependências

source: Interactive display in Jupyter notebooks
pt_br: Exibição interativa em notebooks Jupyter

source: Calculation validation and testing
pt_br: Validação e teste de cálculos

source: Where to Start
pt_br: Por Onde Começar

source: **New users**: Start with :doc:`getting_started` for installation and basic usage
pt_br: **Novos usuários**: Comece com :doc:`getting_started` para instalação e uso básico

source: **Learning the syntax**: See :doc:`expression_syntax` for Leapfrog expression syntax
pt_br: **Aprendendo a sintaxe**: Veja :doc:`expression_syntax` para a sintaxe de expressões do Leapfrog

source: **Building workflows**: Check :doc:`workflow_patterns` for common use cases
pt_br: **Construindo fluxos de trabalho**: Confira :doc:`workflow_patterns` para casos de uso comuns

source: **Using helpers**: Read :doc:`helpers_guide` for helper function details
pt_br: **Usando auxiliares**: Leia :doc:`helpers_guide` para detalhes sobre funções auxiliares

source: **Best practices**: Review :doc:`best_practices` before production use
pt_br: **Melhores práticas**: Revise :doc:`best_practices` antes do uso em produção

source: **Step-by-step guides**: Follow :doc:`tutorials` for complete examples
pt_br: **Guias passo a passo**: Siga :doc:`tutorials` para exemplos completos

source: **API details**: Consult :doc:`api_reference` for technical reference
pt_br: **Detalhes da API**: Consulte :doc:`api_reference` para referência técnica

source: Legal Notice
pt_br: Aviso Legal

source: Pollywog is an independent open-source tool developed to support automation of workflows involving .lfcalc files used in Leapfrog software by Seequent. This tool is not affiliated with, endorsed by, or sponsored by Seequent. Users should review Leapfrog's terms of use before integrating pollywog into their workflows.
pt_br: Pollywog é uma ferramenta independente de código aberto desenvolvida para apoiar a automação de fluxos de trabalho envolvendo arquivos .lfcalc usados no software Leapfrog da Seequent. Esta ferramenta não é afiliada, endossada ou patrocinada pela Seequent. Os usuários devem revisar os termos de uso do Leapfrog antes de integrar o pollywog em seus fluxos de trabalho.

source: Indices and tables
pt_br: Índices e tabelas
